app/views/assessments/_previous_assessments_for_multi.erb

<% if current_user.question_banks.find(:all,:conditions => "no_of_questions > 0" ,:order => 'id').length != 0 then %>
---
SELECT `question_banks`.* FROM `question_banks` WHERE `question_banks`.`user_id` = 6 AND (no_of_questions > 0) ORDER BY id