app/views/assessments/_question_for_multi_page_test.erb

SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 4562 LIMIT 1
---
  Tags:<br/>
  <% @test_detail.question.tagvalues.each do |tagvalue| %>

SELECT `directions`.* FROM `directions` INNER JOIN `question_attributes` ON `directions`.`id` = `question_attributes`.`direction_id` WHERE `question_attributes`.`question_id` = 4562
---
end # end of whether assessment is created using rules or not check %>
<% unless @test_detail.question.directions.nil? or @test_detail.question.directions.blank? %>

SELECT `passages`.* FROM `passages` INNER JOIN `question_attributes` ON `passages`.`id` = `question_attributes`.`passage_id` WHERE `question_attributes`.`question_id` = 4562
---
    <% end
    unless @test_detail.question.passages.nil? or @test_detail.question.passages.blank? %>