lionsher_LMS/app/views/layouts/_courses_footer.html.erb

if current_user.typeofuser == "admin" then
  @tenant = Tenant.find_by_user_id(current_user.id)
  @course_object = Course.find_all_by_user_id(current_user.id)
---
SELECT `tenants`.* FROM `tenants` WHERE `tenants`.`user_id` = 6 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`user_id` = 6 AND (deactivated_at IS NULL)
SELECT `courses`.* FROM `courses` WHERE `courses`.`user_id` = 6