lionsher_LMS/app/views/assessments/_previous_assessments_for_single.erb

SELECT `question_banks`.* FROM `question_banks` WHERE `question_banks`.`user_id` = 6 AND (no_of_questions > 0)
---
<% if current_user.question_banks.find(:all,:conditions => "no_of_questions > 0").length != 0 then %>