lionsher_LMS/app/controllers/question_banks_controller.rb

  def show
    if params.include? 'wrong_entries' then
      @wrong_entries = params[:wrong_entries].to_i
    end
    if params.include? 'assessment_id' then
      @obj_assessment = Assessment.find_by_id(params[:assessment_id])
    end
    @question_bank = QuestionBank.find(params[:id])
    @questions = Question.find(:all, :conditions => ["question_bank_id = ?",(params[:id])], :include => :answers, :order => "id")
---
SELECT `assessments`.* FROM `assessments` WHERE `assessments`.`id` = 245 LIMIT 1
SELECT `question_banks`.* FROM `question_banks` WHERE `question_banks`.`id` = 220 LIMIT 1
SELECT `answers`.* FROM `answers` WHERE `answers`.`question_id` IN (4559, 4560, 4561, 4562, 4563, 4564, 4565, 4566, 4567, 4568, 4569, 4570, 4571, 4572, 4573)
SELECT `questions`.* FROM `questions` WHERE (question_bank_id = '220') ORDER BY id