lionsher_LMS/app/controllers/sessions_controller.rb

SELECT `tenants`.* FROM `tenants` WHERE `tenants`.`custom_url` = 'yamaha' LIMIT 1
SELECT `tenants`.* FROM `tenants` WHERE `tenants`.`user_id` = 6 LIMIT 1
---
  def login
    # Control goes to sessions/login.html
    @tenant = Tenant.find_by_custom_url(request.subdomain)
    if @tenant.nil? then
      flash[:signup_notice] = "#{request.subdomain} does not exist. You have to signup."
      redirect_to("/")
    end
    # AR: DO NOT DELETE this code. The below redirects are used to avoid "on preview logout in IE".
    if !current_user.nil? then
      tenant_for_user = Tenant.find_by_user_id(current_user.user_id)

SELECT `tenants`.* FROM `tenants` WHERE `tenants`.`user_id` = 6 LIMIT 1
SELECT `users`.* FROM `users` WHERE (email = 'karthik@kern-comm.com' and activated_at IS NOT NULL) LIMIT 1
---
  def create
    self.current_user = User.authenticate(params[:email], params[:password])
    if allow_login() then
      case(current_user.typeofuser)
      when "admin","individual buyer","corporate buyer" then
        @tenant = Tenant.find_by_user_id(current_user.id)
      when "learner","evaluator" then
        @tenant = Tenant.find_by_user_id(current_user.user_id)
      end
      @user = User.find_by_email(params[:email])