app/views/courses/index.html.erb

      if current_user.tenant.pricing_plan_id == 4 then
        secs = [ current_user.tenant.expiry_date - Time.now.utc , 0 ].max
---
SELECT `tenants`.* FROM `tenants` WHERE `tenants`.`id` = 2 LIMIT 1