app/controllers/assessments_controller.rb

SELECT `test_details`.* FROM `test_details` WHERE `test_details`.`learner_id` = 58
---
  def multi_page_test
    @current_learner = get_current_learner_object(params[:id])
    @assessment = get_assessment_object(@current_learner.assessment_id)
    if @assessment.show_all_per_page
      redirect_to("/assessments/single_page_test/#{params[:id]}")
    else
      case(params[:from])
      when "marked"
        @test_details = TestDetail.where(:learner_id => @current_learner.id,:marked_status => "marked")

SELECT `test_details`.* FROM `test_details` WHERE `test_details`.`id` = 442 LIMIT 1
SELECT `answers`.* FROM `answers` WHERE `answers`.`id` = 19357 LIMIT 1
UPDATE `learners` SET `recent_timestamp` = '2012-10-17 11:10:02', `updated_at` = '2012-10-17 11:10:02' WHERE `learners`.`id` = 58
UPDATE `test_details` SET `score` = 0.333, `answer_status` = 'correct', `learner_answer_text` = '19357', `attempted_status` = 'answered', `timestamp` = '2012-10-17 11:10:02', `updated_at` = '2012-10-17 11:10:02' WHERE `test_details`.`id` = 442
---
  def ajax_save_answer_maq_multi_page_test
    test_detail = TestDetail.find(params[:id])
    @current_learner = test_detail.learner
    @assessment = @current_learner.assessment
    answer_list = Array.new
    answer_status = Array.new
    answer_object = Answer.find(params[:answer_id].to_i)
    unless test_detail.learner_answer_text.nil?
      answer_list = test_detail.learner_answer_text.split(',')
      answer_status = test_detail.answer_status.split(',')
      if answer_list.include? params[:answer_id]
        position = answer_list.index(params[:answer_id])
        score = get_score_for_maq_question(test_detail.question,answer_object.answer_status,@current_learner.assessment)
        maq_score = test_detail.score - score
        test_detail.score = maq_score
        answer_list.delete(params[:answer_id])
        answer_status.delete_at(position)
      else
        answer_list.push(params[:answer_id])
        answer_status.push(answer_object.answer_status)

SELECT `assessments`.* FROM `assessments` WHERE `assessments`.`id` = 245 LIMIT 1
SELECT `test_patterns`.* FROM `test_patterns` WHERE `test_patterns`.`id` = 1 LIMIT 1
---
  def assessment_details
    @assessment = Assessment.find(params[:id])
    if !(@assessment.test_pattern.nil? or @assessment.test_pattern.blank?) and @assessment.test_pattern_id != 1

SELECT `assessments`.* FROM `assessments` WHERE `assessments`.`id` = 245 LIMIT 1
UPDATE `assessments` SET `description` = '', `instruction_for_test` = '', `updated_at` = '2012-10-17 11:09:23' WHERE `assessments`.`id` = 245
---
  def save_assessment_details
    @assessment = Assessment.find(params[:id])
    @assessment.update_attributes(params[:assessment])

SELECT `assessments`.* FROM `assessments` WHERE `assessments`.`id` = 245 LIMIT 1
---
  def scoring
    @assessment = Assessment.find(params[:id])

SELECT `assessments`.* FROM `assessments` WHERE `assessments`.`id` = 245 LIMIT 1
SELECT `assessments_question_banks`.* FROM `assessments_question_banks` WHERE `assessments_question_banks`.`assessment_id` = 245 ORDER BY id
SELECT `question_banks`.* FROM `question_banks` INNER JOIN `assessments_question_banks` ON `question_banks`.`id` = `assessments_question_banks`.`question_bank_id` WHERE `assessments_question_banks`.`assessment_id` = 245
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 4562 LIMIT 1
UPDATE `assessments` SET `show_question_explanation` = 0, `updated_at` = '2012-10-17 11:09:29' WHERE `assessments`.`id` = 245
---
  def save_scoring
    @assessment = Assessment.find(params[:id])
    admin_in_learner = Learner.new
    if !(params[:assessment][:pass_score].nil? or params[:assessment][:pass_score].blank?)
      admin_in_learner.score_min = params[:assessment][:pass_score]
    else
      admin_in_learner.score_min = "0"
    end
    admin_in_learner.assessment_id = @assessment.id
    admin_in_learner.user_id = current_user.id
    admin_in_learner.admin_id = current_user.id
    admin_in_learner.tenant_id = @assessment.tenant_id
    admin_in_learner.lesson_location = "0"
    if params.include? "question_bank"
      #The below logic is for multi topic
      qb_mapped_to_limit = Hash.new
      qb_mapped_to_limit = map_qb_to_limit()
      no_of_questions = 0
      qb_mapped_to_limit.each_pair { |qb,limit|
        selected_question_bank_id = AssessmentsQuestionBank.find_by_assessment_id_and_question_bank_id(@assessment.id,qb.to_i)
        question_bank = QuestionBank.find(qb.to_i)
        if params[:show_questions] == "limited" then
          selected_question_bank_id.update_attribute(:question_limit, limit.to_i)

SELECT `test_details`.* FROM `test_details` WHERE `test_details`.`learner_id` = 58 AND `test_details`.`question_id` = 4562 LIMIT 1
---
    # fill question status details column with space initially
    question_status_list = Array.new(question_list.split(',').length)
    question_status_list.collect! {|x| x = '' }
    admin_in_learner.question_status_details = question_status_list.join(',')

SELECT `assessments`.* FROM `assessments` WHERE `assessments`.`id` = 245 LIMIT 1
---
  def schedule_assessment
    @assessment = Assessment.find(params[:id])

SELECT `assessments`.* FROM `assessments` WHERE `assessments`.`id` = 245 LIMIT 1
UPDATE `assessments` SET `time_bound` = 'time_bound', `duration_hour` = 1, `duration_min` = 0, `updated_at` = '2012-10-17 11:09:35' WHERE `assessments`.`id` = 245
---
  def create
    @assessment = Assessment.find(params[:id])
    @assessment.update_attributes(params[:assessment])

SELECT `learners`.* FROM `learners` WHERE `learners`.`id` = 58 LIMIT 1
SELECT `assessments`.* FROM `assessments` WHERE `assessments`.`id` = 245 LIMIT 1
---
  def start_test
    @current_learner = Learner.find_by_id(params[:id].to_i)
    @assessment = Assessment.find(@current_learner.assessment_id)

SELECT `test_details`.* FROM `test_details` WHERE `test_details`.`learner_id` = 58 AND `test_details`.`attempted_status` = 'answered'
SELECT `test_details`.* FROM `test_details` WHERE `test_details`.`learner_id` = 58 AND `test_details`.`marked_status` = 'marked'
---
  def review_assessment
    logger.info"IN REVIEW ASSESSMENT >>>>>#{params.inspect}"
    @current_learner = get_current_learner_object(params[:id])
    unless params[:fib_answer_text].nil? or params[:fib_answer_text].blank?
      test_detail = TestDetail.find(params[:fib_test_detail_id])
      test_detail.learner_answer_text = params[:fib_answer_text]
      test_detail.attempted_status = "answered"
      answer = test_detail.question.answers.where(:answer_text => params[:fib_answer_text])
      unless answer.nil? or answer.blank?
        test_detail.answer_id = answer[0].id
        test_detail.answer_status = test_detail.answer.answer_status
      else
        test_detail.answer_id = nil
        test_detail.answer_status = "wrong"
      end
      score = get_score_for_question(test_detail,test_detail.question,test_detail.answer_status,@current_learner.assessment)
      test_detail.score = score
      test_detail.timestamp = Time.now
      test_detail.save!
      duration = test_detail.duration_spent + (test_detail.timestamp - @current_learner.recent_timestamp)
      test_detail.update_attribute(:duration_spent,duration)
      @current_learner.update_attribute(:recent_timestamp,test_detail.timestamp)
    end
    @assessment = get_assessment_object(@current_learner.assessment_id)
    @answered = TestDetail.where(:learner_id => @current_learner.id,:attempted_status => "answered").length
    @skipped = TestDetail.where(:learner_id => @current_learner.id,:attempted_status => "unanswered").length
    @marked = TestDetail.where(:learner_id => @current_learner.id,:marked_status => "marked").length

INSERT INTO `assessments_question_banks` (`assessment_id`, `created_at`, `question_bank_id`, `question_limit`, `updated_at`) VALUES (245, '2012-10-17 11:09:04', 220, NULL, '2012-10-17 11:09:04')
INSERT INTO `assessments` (`allow_improvement`, `am_pm`, `assessment_image_content_type`, `assessment_image_file_name`, `assessment_image_file_size`, `assessment_package_id`, `assessment_type`, `completed_learners`, `correct_ans_points`, `created_at`, `current_learner_id`, `demographics_compulsory`, `demographics_id`, `description`, `duration_hour`, `duration_min`, `end_time`, `groups_assigned`, `incomplete_learners`, `instruction_for_test`, `is_from_all_low_scoring`, `is_linear`, `is_overall`, `is_show_all`, `name`, `no_of_attempted_learners`, `no_of_less_scoring_sections`, `no_of_questions`, `no_of_questions_in_improvement_test`, `overall_less_percentage`, `pass_score`, `reattempt`, `schedule_type`, `section_less_percentage`, `send_score_by_mail`, `show_all_per_page`, `show_question_explanation`, `show_question_wise_scoring`, `show_status`, `skip_question`, `start_time`, `tenant_id`, `test_pattern_id`, `time_bound`, `timeup_learners`, `total_learners`, `unattempted_learners`, `updated_at`, `user_id`, `using_rules`, `wrong_ans_points`) VALUES (1, '', NULL, NULL, NULL, NULL, 'single', 0, 1.0, '2012-10-17 11:09:03', NULL, 0, NULL, NULL, 0, 30, '2012-06-07 05:52:48', NULL, 0, NULL, 1, 0, 1, 1, 'MAQ test 17th oct', 0, 0, NULL, 0, 0, '', 'on', 'open', 0, 'off', 0, NULL, 'off', 'off', 1, '2012-06-07 05:52:41', 2, NULL, NULL, 0, 0, 0, '2012-10-17 11:09:03', NULL, 0, 0.0)
INSERT INTO `question_banks` (`created_at`, `name`, `no_of_questions`, `tenant_id`, `type_of_question_bank`, `updated_at`, `user_id`) VALUES ('2012-10-17 11:09:04', 'MAQ test 17th oct', NULL, 2, NULL, '2012-10-17 11:09:04', 6)
INSERT INTO `questions` (`created_at`, `direction_text`, `error_in_question`, `expiry_date`, `explanation`, `mtf_id`, `no_of_characters`, `question_bank_id`, `question_image_content_type`, `question_image_file_name`, `question_image_file_size`, `question_text`, `question_type`, `tenant_id`, `type_of_dtq`, `updated_at`) VALUES ('2012-10-17 11:09:04', NULL, NULL, NULL, '', NULL, 1.0, 220, NULL, NULL, NULL, 'Hyderabad is in?', 'MAQ', 2, NULL, '2012-10-17 11:09:04')
---
  def save_assessment
    @upload_type = params[:upload_type]
    if params[:upload_type] == "excelsheet" and params[:import][:excel] == ""
      redirect_to("/assessments/assessment_creation/#{current_user.id}?pattern=#{params[:pattern]}")
    else
      @assessment = Assessment.new()
      @assessment.name = params[:question_bank][:name]
      @assessment.assessment_type = params[:assessment_type]
      @assessment.tenant_id = current_user.tenant_id
      @assessment.save

UPDATE `assessments_question_banks` SET `question_limit` = 15, `updated_at` = '2012-10-17 11:09:09' WHERE `assessments_question_banks`.`id` = 245
UPDATE `question_banks` SET `no_of_questions` = 15, `updated_at` = '2012-10-17 11:09:09' WHERE `question_banks`.`id` = 220
---
        end
        @obj_question_bank.user_id = current_user.id
        @obj_question_bank.tenant_id = current_user.tenant_id
        @obj_question_bank.save

SELECT `assessments_question_banks`.* FROM `assessments_question_banks` WHERE `assessments_question_banks`.`question_bank_id` = 220
UPDATE `assessments` SET `no_of_questions` = 15, `updated_at` = '2012-10-17 11:09:09' WHERE `assessments`.`id` = 245
---
        assessment_question_bank = create_and_save_assessment_question_bank(@assessment.id,@obj_question_bank.id,@obj_question_bank.no_of_questions)
      else
        if params[:assessment_type] == "single"
          @obj_question_bank = QuestionBank.find_by_id(params[:radio_check])

          @assessment.update_attribute(:no_of_questions, @obj_question_bank.no_of_questions)

SELECT `questions`.* FROM `questions` INNER JOIN `question_attributes` ON `questions`.`id` = `question_attributes`.`question_id` WHERE `question_attributes`.`question_bank_id` = 220
---
          end
        end
        no_of_questions = @obj_question_bank.questions
        @obj_question_bank.update_attribute(:no_of_questions,no_of_questions.length)

SELECT `test_details`.* FROM `test_details` WHERE `test_details`.`learner_id` = 58
---
        #        @current_learner.update_attribute(:question_status_details,"")
        learner_values['question_status_details'] = ""
      end
      unless @current_learner.test_details.nil? or @current_learner.test_details.blank?

UPDATE `learners` SET `lesson_location` = '0', `lesson_status` = 'not attempted', `timestamps` = '', `updated_at` = '2012-10-17 11:19:20' WHERE `learners`.`id` = 58
---
      case(@assessment.show_status)
      when "on"
        save_test_details("normal",@current_learner,@assessment,current_user)
        @current_learner.update_attributes(learner_values)