app/controllers/courses_controller.rb

SELECT `courses`.* FROM `courses` WHERE `courses`.`user_id` = 6 AND (size > 0) ORDER BY id DESC
SELECT `users`.* FROM `users` WHERE `users`.`user_id` = 6 AND (deactivated_at IS NULL)
---
  def set_feedback
    @courses = Course.find_all_by_user_id(current_user.id)

SELECT `assessments`.* FROM `assessments` WHERE `assessments`.`id` = 245 LIMIT 1
---
  def preview
    if params.include? "assessment_id" then
      @assessment = Assessment.find_by_id(params[:assessment_id])