lionsher_LMS/app/views/courses/_all_assessments.erb

SELECT COUNT(*) FROM `reports` WHERE `reports`.`assessment_id` = 244 AND `reports`.`for_whom` = 'admin'
---
            <% if assessment.total_learners > 0 then %>
                <a <% if assessment.reports.where(:for_whom => "admin").count > 0 %>href="/assessments/report/<%=h assessment.id %>"<% else %>href="/reports/learners_for_assessment/<%=h assessment.id %>"<% end %>>Report</a> &nbsp; | &nbsp;