lionsher_LMS/app/views/courses/_logo.html.erb

SELECT `tenants`.* FROM `tenants` WHERE `tenants`.`custom_url` = 'yamaha' LIMIT 1
---
else
  @tenant = Tenant.find_by_custom_url(request.subdomain)